БИТУправление_медицинским_центром_демо/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаТоваров</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВыработки</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <attributes>
    <name>TRADENAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LATNAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGNUM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>REGDATE</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_REGISTRATOR</name>
    <comment>Организация-регистратор</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_REGISTRATOR</name>
    <comment>Страна организации-регистратора</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMGROUP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>STATUS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NDV</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGCERTID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMAACTIONS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>STRONG</name>
    <type>
      <types>EnumRef.СильнодействующиеИЯды</types>
    </type>
  </attributes>
  <attributes>
    <name>JNVLS</name>
    <type>
      <types>EnumRef.СпискиЖНиВЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>NARCO</name>
    <type>
      <types>EnumRef.СпискиНаркотическихВеществ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЕдиницыУслуги</name>
    <comment>Одна единица услуги имеет данную продолжительность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМедицинскихУслуг</name>
    <type>
      <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовкаКлиентаКСдачеАнализа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DICOMModality</name>
    <type>
      <types>CatalogRef.DICOMModality</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>МедосмотрСправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЦенаМедосмотраИзДействийМедосмотра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КЛП</name>
    <comment>Код лекарства в ЕСКЛП РФ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>41</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АТХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМедУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТРУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованнаяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВредныйФакторСправки</name>
    <type>
      <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФомированияЦеныМедосмотра</name>
    <type>
      <types>EnumRef.СпособФормированияЦеныМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПринципал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомплектующиеНоменклатуры</name>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКомплектующей</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопутствующиеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.МоделиОборудования</types>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеDICOM</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <comment>Виды номенклатуры</comment>
  <enumValues>
    <name>Материал</name>
    <comment>Основной вид ТМЦ, учитываемый на складах</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Услуга, не хранится на складах</comment>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/Номенклатура/Forms/ФормаВыбораУпр/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КнопкаПанельИнформации.Пометка = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ФормаСпискаНоменклатуры", "ОтображатьПанельИнформации", Ложь);
	Элементы.ГруппаПанельИнформации.Видимость = Элементы.КнопкаПанельИнформации.Пометка;
	
	ТабличноеПолеОстатки.Параметры.УстановитьЗначениеПараметра("Номенклатура",Элементы.Список.ТекущаяСтрока);	
	
	// Настройка видимости панели информации.
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("ВидНоменклатуры")
		И ТипЗнч(Параметры.Отбор.ВидНоменклатуры) = Тип("ФиксированныйМассив")
		И Параметры.Отбор.ВидНоменклатуры.Найти(Перечисления.ВидыНоменклатуры.Материал) = Неопределено
	Тогда
		Элементы.ГруппаОстатки.Видимость = Ложь;
		Элементы.ЦенаЕдиницаИзмерения.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОстатки.Видимость = ПравоДоступа("Просмотр", Метаданные.РегистрыНакопления.ПартииТоваровНаСкладах);
	КонецЕсли;
	
	Элементы.ЦенаХарактеристикаНоменклатуры.Видимость = УправлениеНастройками.ПараметрУчета("ВестиУчетПоХарактеристикам");
	
	ТабличноеПолеОстатки.Параметры.УстановитьЗначениеПараметра	("ЕдиницаИзмерения", Неопределено);
	ТабличноеПолеОстатки.Параметры.УстановитьЗначениеПараметра	("Номенклатура", Неопределено);
	ТабличноеПолеЦена.Параметры.УстановитьЗначениеПараметра		("Номенклатура", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.ФормаСкрытьПоказатьАрхивные, Список, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("ОтображатьПанельИнформации", Элементы.КнопкаПанельИнформации.Пометка);
	
	РаботаСФормамиСервер.СохранитьНастройкиФормы(НастройкиФормы, "ФормаСпискаНоменклатуры"); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ГруппаПанельИнформации.Видимость Тогда
		// Если панель видна, то обновим её данные.
		ОбновитьОстаткиИЦены();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаПанельИнформацииНажатие(Команда)
	
	Элементы.КнопкаПанельИнформации.Пометка = Не Элементы.КнопкаПанельИнформации.Пометка;
	Элементы.ГруппаПанельИнформации.Видимость = Элементы.КнопкаПанельИнформации.Пометка;	
	Если Элементы.ГруппаПанельИнформации.Видимость Тогда
		ОбновитьОстаткиИЦены();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)

	РаботаСДиалогамиКлиент.ПоместитьВАрхив(Элементы.Список.ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьАрхивные(Команда)

	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.ФормаСкрытьПоказатьАрхивные, Список);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбновитьОстаткиИЦены()
	
	ЕдиницаИзмерения = ?(Элементы.Список.ТекущиеДанные = Неопределено, Неопределено, Элементы.Список.ТекущиеДанные.ЕдиницаХраненияОстатков);
	ТабличноеПолеОстатки.Параметры.УстановитьЗначениеПараметра	("ЕдиницаИзмерения", ЕдиницаИзмерения);
	ТабличноеПолеОстатки.Параметры.УстановитьЗначениеПараметра	("Номенклатура", Элементы.Список.ТекущаяСтрока);
	ТабличноеПолеЦена.Параметры.УстановитьЗначениеПараметра		("Номенклатура", Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти
